"Back" = "Tilbake";
"Continue" = "Fortsett uten";
"create New User" = "Opprett ny profil";
"Create New User Info" = "Here you can create a personal TimeFor.TV profile. This helps you store your settings between devices and gives you extra features.";
"create Your New Account" = "Opprett ny profil";
"Email Address" = "E-mailadresse";
"Your Email Address" = "E-mailadresse";
"Login" = "Logg inn";
"Login Subscribtion Info" = "To get access to the full features of TimeFor.TV we recommended that you login with a profile.";
"Mobile" = "Mobilnummer til påminnelse på SMS";
"Name" = "Navn";
"Password" = "Passord";
"Register Mobile for SMS Info" = "* Your mobile no. will be used if you wish to receive SMS reminders. Please visit timefor.tv/products/sms for detailed information and conditions.";
"Add Channels" = "Legg til kanaler";
"Channels" = "Kanaler";
"Channel.no.air.1" = "Sendeopphold";
"Channel.no.air.2" = "Tab to see full day";
"Channel.no.transmission.1" = "Ingen sendinger akkurat nå.";
"Channel.no.transmission.2" = "Tab to see full day";
"Edit Channels Navigation Title " = "Rediger kanaler";
"Please Select Channels before Adding" = "Please select channels before adding";
"Save" = "Lagre";
"Search Channel" = "Søk kanaler";
"Search Programs" = "Søk i TV-oversikten";
"Searched" = "Søk";
"Shows" = "Viser:";
"Synching Channels" = "Henter innhold";
"Today" = "I dag";
"Logout" = "Logg av";
"Logout Cell" = "Du er logget inn som";
"Push Notification Cell" = "Push notification devices";
"No Commercial" = "Deaktiver reklame på TimeFor.TV";
"Recommendation" = "Anbefalinger";
"Recommend" = "Anbefal";
"Don't recommend" = "Ikke anbefal";
"Select Date" = "Velg dag";
"By Agent" = "Av agent";
"Keyboard.done" = "Done";
"Segment.planned" = "Planlagt";
"Segment.agents" = "Agenter";
"Edit planning" = "Rediger planlegging";
"Add planning" = "Planlegg";
"Edit" = "rediger";
"Edit agent" = "rediger";
"Add notification" = "Legg til påminnelse";
"Search in" = "Søk i";
"Original Title" = "Original tittel";
"Title" = "Tittel";
"Summary" = "Omtale";
"All" = "Alle";
"Title or summary" = "Tittel erller omtale";
"Remind me" = "Påminn meg";
"Remind me via" = "Påminn meg via";
"Remind Time" = "Tidspunkt";
"Remind me when it's aired" = "Påminn meg når det sendes";
"Plan every time it's aired" = "Planlegg hver gang";
"Select Days" = "Choose days";
"Search Target" = "Søk i";
"Search Type" = "Søketype";
"Select Channel" = "Velg kanal";
"Minutes before" = "Minutes before";
"Hours before" = "Hours before";
"Days before" = "Days before";
"On days" = "On days";
"Weekdays(mon-fri)" = "Hverdager";
"Weekends(sat-sun)" = "Helger";
"Mondays" = "Mandager";
"Tuesdays" = "Tirsdager";
"Wednesdays" = "Onsdager";
"Thursdays" = "Torsdager";
"Fridays" = "Fredager";
"Saturdays" = "Lørdager";
"Sundays" = "Søndager";
"All weekdays" = "Når som helst";
"All hours" = "Når som helst";
"Is" = "er";
"Contains" = "Inneholder";
"Begins with" = "begynner med";
"Ends with" = "slutter med";
"Between" = "Mellom";
"On" = "på";
"Show short summary in listings" = "Vis kort sammendrag i programoversikten";
"Settings" = "Innstillinger";
"From" = "Fra";
"On channels" = "Kanaler";
"Plan all airings where" = "Planlegg alle sendinger hvor";
"Limitations" = "Begrensninger";
"Plans" = "Planlagt";
"Plan" = "Planlegg";
"Find on IMDB" = "Søk på IMDb";
"Share on Facebook" = "Del på Facebook";
"Share on Twitter" = "Del på Twitter";
"You post is now shared" = "You post is now shared";
"No records found" = "Det ble ikke funnet noen sendinger";
"Please provide us with a valid email address" = "Vennligst oppgi aktiv e-mailadresse";
"Please fill name, email and password as minimum" = "Please fill name, email and password as minimum";
"Disable commercials on TimeFor.TV (apps)" = "Deaktiver annonser på TimeFor.TV (apps)";
"Full version of TimeFor.TV for iPhone and iPad" = "Full versjon av TimeFor.TV til iPhone og iPad";
"Full version of TimeFor.TV for Android" = "Full versjon av TimeFor.TV til Andriod";
"Full version of TimeFor.TV for Windows" = "Full versjon av TimeFor.TV til Windows";
"Full version of TimeFor.TV for Facebook" = "Full versjon av TimeFor.TV til Facebook";
"Full version of TimeFor.TV for Mac" = "Full versjon av TimeFor.TV til Mac";
"Download EPG data as XMLTV for your media center" = "Last ned EPG data i XMLTV format til ditt multimediesenter";
"Demands a TimeFor.TV Pro or TimeFor.TV+ subscription beginning at only EUR 5 an year" = "Krever et TimeFor.TV Pro eller et TimeFor.TV+ abonnement fra kun NOK 39,- per år ";
"Functions" = "Funksjoner";
"EUR 5/year" = "NOK 39,-/årlig";
"EUR 15/year" = "NOK 114,-/årlig";